Inserts a vertex into the stream and associated buffer.
  Namespace:   Autodesk.Revit.DB.DirectContext3D
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.420)
  Since:  2017
 Syntax
  C#
public void AddVertex(
	VertexPositionNormal vertex
)
  Visual Basic
Public Sub AddVertex ( _
	vertex As VertexPositionNormal _
)
  Visual C++
public:
void AddVertex(
	VertexPositionNormal^ vertex
)
 Parameters
  vertex
 Type:  Autodesk.Revit.DB.DirectContext3D VertexPositionNormal
 The vertex to be inserted.
 Exceptions
  Exception  |   Condition
   Autodesk.Revit.Exceptions ArgumentNullException   |   A non-optional argument was NULL
   Autodesk.Revit.Exceptions InvalidOperationException   |   Thrown if the associated buffer is not mapped. -or- Thrown if the associated buffer has insufficient space.
 See Also
  VertexStreamPositionNormal Class
  Autodesk.Revit.DB.DirectContext3D Namespace